package com.sxjkwm.pm.constants;

public enum InvoiceError implements Constant<String, String> {
    E0000("E0000", "开票提交成功"),
    E4000("E4000", "接口调用失败"),
    E9101("E9101", "开票类型错误(1:正票 2:红票)"),
    E9102("E9102", "发票号码或发票代码不正确"),
    E9103("E9103", "该发票不能重复冲红"),
    E9104("E9104", "购方邮箱不能超过50位"),
    E9105("E9105", "折扣行的商品名称必须和被折扣行相同"),
    E9106("E9106", "订单编号或流水号不能重复"),
    E9107("E9107", "代开标志只能为0和1"),
    E9108("E9108", "折扣行金额不能大于被折扣行的金额"),
    E9110("E9110", "折扣行必须紧挨被折扣行之后"),
    E9111("E9111", "蓝票折扣行商品数量应为负"),
    E9112("E9112", "折扣行商品税率必须和被折扣行商品税率相同"),
    E9113("E9113", "红票购方地址与蓝票购方地址不符"),
    E9114("E9114", "蓝票被折扣行商品数量应为正"),
    E9115("E9115", "红票购方电话与蓝票购方电话不符"),
    E9116("E9116", "红票折扣行商品数量应为正"),
    E9117("E9117", "红票购方名称与蓝票购方名称不符"),
    E9118("E9118", "红票购方税号与蓝票购方税号不符"),
    E9119("E9119", "红票被折扣行商品数量应为负"),
    E9120("E9120", "红票购方银行账号与蓝票购方银行账号不符"),
    E9121("E9121", "获取商品编码失败"),
    E9122("E9122", "商品详情为空"),
    E9123("E9123", "项目单价为空时，含税金额、不含税金额、税额都不能为空"),
    E9124("E9124", "含税金额不能超过20位"),
    E9125("E9125", "含税金额只是能数字"),
    E9126("E9126", "不含税金额不能超过20位"),
    E9127("E9127", "不含税金额只能是数字"),
    E9128("E9128", "税额不能超过20位"),
    E9129("E9129", "税额只是能数字"),
    E9130("E9130", "（不含税金额+税额）不等于含税金额"),
    E9131("E9131", "金额*税率-税额大于0.06,明细行名称:xxx,第x行"),
    E9154("E9154", "订单被拆分后大于10张发票"),
    E9138("E9138", "商品编码获取出现异常"),
    E9301("E9301", "企业信息备案错误,请联系诺诺网"),
    E9302("E9302", "身份认证与当前企业税号不相符"),
    E9338("E9338", "该企业无权限调用API开票"),

    ;

    private String code;

    private String msg;

    InvoiceError(String code, String msg) {
        this.code = code;
        this.msg = msg;
    }

    @Override
    public String getValue() {
        return code;
    }

    @Override
    public String getLabel() {
        return msg;
    }

}
